regions = ['全国',
           '北京', '天津', '河北', '山西', '内蒙古',
           '辽宁', '吉林', '黑龙江',
           '上海', '江苏', '浙江', '安徽', '福建', '江西', '山东',
           '河南', '湖北', '湖南', '广东', '广西', '海南',
           '重庆', '四川', '贵州', '云南', '西藏', '陕西',
           '甘肃', '青海', '宁夏', '新疆']

# 海水的密度 改为 海水密度
keywords = ['巴拿马运河', '北冰洋', '波斯湾', '渤海', '大陆漂移', '大西洋', '东海', '黄海', '马六甲海峡', '南海',
            '南沙群岛', '太平洋', '西沙群岛', '印度洋', '潮汐', '厄尔尼诺', '海浪', '海水密度', '拉尼娜', '洋流',
            '反渗透技术', '海水淡化', '海盐', '可燃冰', '锰结核', '溴', '大洋一号', '海龙号', '蛟龙号', '南极泰山站',
            '雪龙号', '远望号', '长城站', '反渗透法', '海洋大学', '遥感技术', '赤潮', '海水污染', '海洋污染',
            '红树林', '人工鱼礁', '珊瑚礁', '休渔', '风暴潮', '海啸', '寒潮', '飓风', '离岸流', '台风', '海平面上升',
            '印度尼西亚海啸', '沉没', '触礁', '东方之星', '搁浅', '古斯特洛夫号', '泰坦尼克号', '救生舱', '救生船',
            '救生筏', '救生衣', '滨海旅游', '海洋经济', '渔业', '造船业', '滨海旅游区', '海洋工程', '盐业', '海产品',
            '海水珍珠', '海鲜', '海鲜大排档', '海岛旅游', '海南旅游', '青岛旅游', '三亚旅游', '厦门旅游', '舟山旅游',
            '海岸线', '海岛', '海湾', '海域', '湿地', '带鱼', '海带', '海苔', '南极磷虾', '鱿鱼', '紫菜', '海洋石油',
            '波浪', '潮汐能', '可再生能源', '迪拜人工岛', '人工岛', '棕榈岛', '海参', '乌贼骨', '鱼肝油', '港口',
            '海底隧道', '海上钻井平台', '跨海大桥', '中海油', '海水淡化设备', '海水稻', '海水晶', '达伽马',
            '发现新大陆', '哥伦布', '好望角', '麦哲伦', '南极探险', '甲午海战', '罗盘', '下南洋', '徐福', '郑和',
            '郑和下西洋', '指南针', '瓷器', '海上丝绸之路', '泉州', '丝绸', '海神', '龙王庙', '妈祖', '水阙仙班',
            '四海龙王', '波塞冬', '开渔节', '青岛海洋节', '世界海洋日', '中国航海日', '八仙过海', '观沧海',
            '海底两万里', '精卫填海', '浪淘沙 北戴河', '鲁滨逊漂流记', '面朝大海', '大海啊故乡', '海贼王',
            '南海风云', '外婆的澎湖湾', '我爱这蓝色的海洋', '悉尼歌剧院', '海洋传说', '龙的传说', '哪吒闹海',
            '大沽口炮台', '南澳一号', '南海一号', '致远舰', '中山舰', '大连海事大学', '海洋知识竞赛', '中国海洋大学',
            '海洋公园', '海洋馆', '海洋世界', '文化馆', '游艇展', '波茨坦公告', '开罗宣言', '联合国海洋法公约',
            '南极条约', '北极理事会', '国际海事组织', '国际海洋法法庭', '东海大陆架', '领海基线', '南海岛礁',
            '南海地图', '专属经济区', '北极', '公海', '南极', '搁置争议', '南海各方行为宣言', '南海宣言',
            '一带一路', '钓鱼岛', '钓鱼岛国有化', '钓鱼岛争端', '黄岩岛事件', '南海仲裁案', '北海舰队',
            '东海舰队', '海军', '航空母舰', '护卫舰', '辽宁号', '南海舰队', '潜艇', '驱逐舰', '三大舰队',
            '巡洋舰', '中国海军', '东海军演', '海军演习', '黄海军演', '南海军演', '亚丁湾护航', '港口法',
            '海岛保护法', '海洋环境保护法', '海域使用管理法', '渔业法', '保护海洋', '海砂', '红珊瑚', '国家海洋局',
            '国家海洋信息中心', '海事局', '海洋局', '海洋环境保护', '海域使用论证', '海域使用权']

start_date = '20160101'

end_date = '20171231'
