
provinces = ('安徽', '北京', '福建', '甘肃', '广东', '广西', '贵州', '海南', '河北', '河南', '黑龙江', '湖北', '湖南',
             '吉林', '江苏', '江西', '辽宁', '内蒙古', '宁夏', '青海', '山东', '山西', '陕西', '上海', '四川', '天津',
             '西藏', '新疆', '云南', '浙江', '重庆')

cybercitizen = {
    '安徽': 2395, '北京': 1647, '福建': 2648, '甘肃': 1005, '广东': 7768, '广西': 2033, '贵州': 1346,
    '海南': 466, '河北': 3731, '河南': 3703, '黑龙江': 1707, '湖北': 2723, '湖南': 2685, '吉林': 1313,
    '江苏': 4416, '江西': 1759, '辽宁': 2731, '内蒙古': 1259, '宁夏': 326, '青海': 318, '山东': 4789,
    '山西': 1975, '陕西': 1886, '上海': 1773, '四川': 3260, '天津': 956, '西藏': 142, '新疆': 1262,
    '云南': 1761, '浙江': 3596, '重庆': 1445}

citizen = {
    '北京': 2152.941176, '上海': 2425.444596, '广东': 10729.28177, '福建': 3804.597701, '浙江': 5506.891271,
    '天津': 1517.460317, '辽宁': 4390.675241, '江苏': 7956.756757, '新疆': 2298.724954, '青海': 583.4862385,
    '山西': 3643.911439, '海南': 903.1007752, '河北': 7388.118812, '内蒙古': 2502.982107, '陕西': 3772,
    '宁夏': 661.2576065, '山东': 9793.456033, '重庆': 2991.718427, '吉林': 2752.620545, '湖北': 5818.376068,
    '西藏': 318.3856502, '黑龙江': 3835.955056, '广西': 4750, '四川': 8150, '湖南': 6729.323308,
    '安徽': 6078.680203, '河南': 9446.428571, '甘肃': 2590.206186, '江西': 4545.219638, '贵州': 3505.208333,
    '云南': 4708.55615}

"""60年代六大经济协作区划分"""
sixty_6_da_jing_ji_xie_zuo_qu_province_2_region = {
    "北京": "华北", "天津": "华北", "河北": "华北", "山西": "华北", "内蒙古": "华北",
    "辽宁": "东北", "吉林": "东北", "黑龙江": "东北",
    "上海": "华东", "江苏": "华东", "浙江": "华东", "山东": "华东", "安徽": "华东", "江西": "华东", "福建": "华东",
    "河南": "中南", "湖北": "中南", "湖南": "中南", "广东": "中南", "广西": "中南", "海南": "中南",
    "四川": "西南", "重庆": "西南", "贵州": "西南","云南": "西南", "西藏": "西南",
    "陕西": "西北", "甘肃": "西北", "青海": "西北", "宁夏": "西北", "新疆": "西北"}

"""七五计划中的东中西三大经济地带或地区的划分"""
plan75_3_da_jing_ji_di_dai_province_2_region = {
    '辽宁': '东部', '河北': '东部', '北京': '东部', '天津': '东部', '山东': '东部', '江苏': '东部',
    '浙江': '东部', '上海': '东部', '福建': '东部', '广东': '东部', '广西': '东部', '海南': '东部',
    '黑龙江': '中部', '吉林': '中部', '内蒙古': '中部', '山西': '中部', '河南': '中部',
    '湖北': '中部', '江西': '中部', '安徽': '中部', '湖南': '中部',
    '陕西': '西部', '甘肃': '西部', '青海': '西部', '宁夏': '西部', '新疆': '西部', '四川': '西部',
    '重庆': '西部', '云南': '西部', '贵州': '西部', '西藏': '西部'}

"""自定义的按照与海洋距离的区域划分"""
sea_distance_province_2_region = {
    '北京': '沿海', '天津': '沿海', '河北': '沿海', '辽宁': '沿海', '上海': '沿海', '江苏': '沿海', '浙江': '沿海',
    '山东': '沿海', '福建': '沿海', '广东': '沿海', '广西': '沿海', '海南': '沿海',
    '吉林': '近海', '黑龙江': '近海', '安徽': '近海', '江西': '近海', '河南': '近海', '湖北': '近海', '湖南': '近海',
    '山西': '远海', '内蒙古': '远海', '四川': '远海', '重庆': '远海', '贵州': '远海', '云南': '远海', '陕西': '远海', '宁夏': '远海',
    '西藏': '内陆', '甘肃': '内陆', '青海': '内陆', '新疆': '内陆'}

"""自定义的按照沿海与内陆区域划分"""
yan_hai_nei_lu_province_2_region = {
    '北京': '沿海', '天津': '沿海', '河北': '沿海', '辽宁': '沿海', '上海': '沿海', '江苏': '沿海', '浙江': '沿海',
    '山东': '沿海', '福建': '沿海', '广东': '沿海', '广西': '沿海', '海南': '沿海',
    '吉林': '内陆', '黑龙江': '内陆', '安徽': '内陆', '江西': '内陆', '河南': '内陆', '湖北': '内陆', '湖南': '内陆',
    '山西': '内陆', '内蒙古': '内陆', '四川': '内陆', '重庆': '内陆', '贵州': '内陆', '云南': '内陆', '陕西': '内陆', '宁夏': '内陆',
    '西藏': '内陆', '甘肃': '内陆', '青海': '内陆', '新疆': '内陆'}


def citizen_by_region(province_2_region):
    """计算各个地区公民的人数，province_2_region为省份到地区的映射"""
    if province_2_region is None:
        return citizen
    else:
        return sum_by_value(province_2_region, citizen)


def cybercitizen_by_region(province_2_region):
    """计算各个地区网民的人数，province_2_region为省份到地区的映射"""
    if province_2_region is None:
        return cybercitizen
    else:
        return sum_by_value(province_2_region, cybercitizen)


def sum_by_value(province_2_region, dict):
    """按照dict提供的数值，计算各地区的求和值"""
    total = {}
    for province, region in province_2_region.items():
        total[region] = total.get(region, 0) + dict.get(province)
    return total


if __name__ == '__main__':
    print('60年代6大经济协作区对应的各地区公民人口总数')
    print(citizen_by_region(sixty_6_da_jing_ji_xie_zuo_qu_province_2_region))
    print('60年代6大经济协作区对应的各地区网民人口总数')
    print(cybercitizen_by_region(sixty_6_da_jing_ji_xie_zuo_qu_province_2_region))
    print('75计划三大经济地带对应的各地区公民人口总数')
    print(citizen_by_region(plan75_3_da_jing_ji_di_dai_province_2_region))
    print('75计划三大经济地带对应的各地区网民人口总数')
    print(cybercitizen_by_region(plan75_3_da_jing_ji_di_dai_province_2_region))